# 230901(금) Day09

# 개미 군단
# def solution(hp):
#     #장군5, 병정3, 일개미1
#     #5로 나눠서 0이면 5로 나눈 몫
#     #3으로 나눠서 0이면 3으로 나눈 몫
#     #아니면 5로 나눈 몫 + 3으로 나눈 몫 + 나머지
#     if hp % 5 == 0 :
#         return hp // 5
#     elif hp % 3 == 0 :
#         return hp // 3
#     else :
#         hp = hp - ((hp % 5) // 3)
#         return (hp // 5) + ((hp % 5) // 3)
#
#
# print(solution(24))



#모스부호(1)
morse = {
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
}
def solution(letter):
    letter.replace()
    return answer

print(solution(".... . .-.. .-.. ---"))
